import pythainlp as thnlp
from pythainlp.soundex import lk82, metasound, udom83
from pythainlp.word_vector import doesnt_match
from time import time

def Time(Start):
    runTime = time() - Start
    if runTime < 60:    
        print("เรียบร้อย ใช้เวลารันไป", round(runTime, 2), "วินาที")
    elif runTime < 60 * 60:
        print("เรียบร้อย ใช้เวลารันไป", int(runTime / 60), "นาที", round(runTime % 60, 2), "วินาที")
    else:
        print("เรียบร้อย ใช้เวลารันไป", int(runTime / (60 * 60)), "ชั่วโมง", int((runTime % 60 * 60) // 60), "นาที", round(runTime % 60, 2), "วินาที")

# https://www.bualabs.com/archives/3740/python-word-tokenize-pythainlp-example-algorithm-deepcut-newmm-longest-python-pythainlp-ep-2/
Start = time()
text = """
เมืองเชียงรายมีประวัติศาสตร์อันยาวนาน เป็นที่ตั้งของหิรัญนครเงินยางเชียงแสน 
ซึ่งเป็นนครหลวงก่อนการกำเนิดอาณาจักรล้านนา มี "คำเมือง" เป็นภาษาท้องถิ่น 
มีเอกลักษณ์เฉพาะตัวทั้งด้านศิลปะ ประเพณีวัฒนธรรมที่มีความหลากหลายทางชาติพันธุ์ในรูปแบบล้านนา 
ไทใหญ่ ไทเขิน และไทลื้อจากสิบสองปันนาผสมผสานกัน นอกจากนี้จังหวัดเชียงรายยังขึ้นชื่อว่าเป็น 
"เมืองศิลปะ" และเป็นที่เกิดของศิลปินที่มีอิทธิพลอย่างมากในวงการศิลปะไทย โดยเฉพาะ ถวัลย์ ดัชนี 
ผู้สร้างสรรค์บ้านดำ และ เฉลิมชัย โฆษิตพิพัฒน์ ผู้สร้างสรรค์วัดร่องขุ่นและหอนาฬิกาเมืองเชียงราย 
สถานที่ท่องเที่ยวสำคัญของเชียงรายที่มีเอกลักษณ์เฉพาะของศิลปิน 
และเป็นแบบอย่างของวัดร่องเสือเต้นซึ่งเป็นอีกสถานที่ท่องเที่ยวสำคัญ

ครั้นต่อมาเมื่อล้านนาตกไปอยู่ในปกครองของพม่า ในปี พ.ศ. 2101 
พม่าได้ตั้งขุนนางปกครองเมืองเชียงรายเรื่อยมา หลังจากนั้น พ.ศ. 2317 
เจ้ากาวิละแห่งลำปางได้สวามิภักดิ์ต่อกรุงเทพฯ ทำให้หัวเมืองล้านนาฝ่ายใต้ตกเป็นประเทศราชของสยาม 
ขณะที่เชียงรายและหัวเมืองล้านนาฝ่านเหนืออื่น ๆ ยังคงอยู่ใต้อำนาจพม่า 
ล้านนากลายเป็นพื้นที่แย่งชิงอำนาจระหว่างสยามกับพม่า ในช่วงเวลาดังกล่าวเมืองเชียงรายเริ่มร้างผู้คน 
ประชาชนอพยพหนีภัยสงครามไปอยู่เมืองอื่น บ้างก็ถูกกวาดต้อนลงไปทางใต้ พ.ศ. 2247 
เมืองเชียงแสนฐานที่มั่นสุดท้ายของพม่า ถูกกองทัพเชียงใหม่ ลำปาง และน่าน ตีแตก 
เมืองเชียงรายจึงกลายสภาพเป็นเมืองร้างตามเมืองเชียงแสน

โครงสร้างเศรษฐกิจของจังหวัดเชียงรายมาจากการเกษตร ป่าไม้ และการประมงเป็นหลัก 
พืชสำคัญทางเศรษฐกิจของจังหวัดเชียงราย ได้แก่ ข้าวจ้าว ข้าวโพดเลี้ยงสัตว์ สัปปะรด มันสัมปะหลัง 
ส้มโอ ลำไย และลิ้นจี่ ซึ่งทั้งคู่เป็นผลไม้สำคัญที่สามารถปลูกได้ในทุกอำเภอของจังหวัด 
นอกจากนี้จังหวัดเชียงรายยังขึ้นชื่อสำหรับการเพาะปลูกชา อันเป็นพืชเศรษฐกิจใหม่ของจังหวัดเชียงรายในปี 
พ.ศ. 2561 นอกจากนี้จังหวัดเชียงรายยังเป็นจังหวัดที่มีความสำคัญในเชิงการท่องเที่ยว 
มีจำนวนผู้เยี่ยมเยียนจังหวัดเชียงรายทั้งหมดราว 3,600,000 คนในปี 2561 มากเป็นอันดับที่สองนภาคเหนือ 
รองจากจังหวัดเชียงใหม่ การท่องเที่ยวสร้างรายได้ให้กับจังหวัดมากกว่า 28,500 บาท
"""

Engine = ["onecut", "newmm", "newmm-safe", "longest", "mm", "multi_cut", "nercut"]
Q1 = [thnlp.word_tokenize(text, engine=i) for i in Engine]

text = "ยายกินลำไยน้ำลายยายไหลย้อย"
Q2 = thnlp.tokenize.multi_cut.find_all_segment(text)
Q3 = thnlp.tokenize.multi_cut.mmcut(text)
Q4 = thnlp.tokenize.multi_cut.segment(text)

Q5 = thnlp.subword_tokenize(text)
Q6 = thnlp.subword_tokenize(text, engine="tcc")
Q7 = thnlp.tokenize.tcc.segment(text) #Low-level TCC

Q8 = thnlp.word_vector.sentence_vectorizer("อ้วนเสี้ยวเข้ายึดแคว้นกิจิ๋ว")
#Q8 = doesnt_match(['อาหารเช้า','อาหารเที่ยง','อาหารเย็น','พริกไทย'])
Time(Start)